meshiterro/app/controllers/post_images_controller.rb

  def index
    @post_images = PostImage.page(params[:page]).reverse_order
---
SELECT "post_images".* FROM "post_images"